#include <iostream>

using namespace std;

int main(void) {
    int n;
    cin >> n;
    
    if(n % 2 == 0)
    {
        cout << n << " is even";
    }
    else
    {
        cout << n << " is odd";
    }
    return 0;
}


/*****************************************************************************************
cout << n << " is " << (n%2==0 ? "even":"odd");

삼항 연산자 (? :)
조건이 true면 ? 뒤의 값을 반환.
조건이 false면 : 뒤의 값을 반환.
*****************************************************************************************/
